/*
  String_ui.strings
  iina

  Created by lhc on 3/1/2017.
  Copyright © 2017 lhc. All rights reserved.
*/
// Common

"general.on" = "Włączono";
"general.off" = "Wyłączono";
"general.login" = "Zaloguj się";
"general.logout" = "Wyloguj";
"general.ok" = "OK";
"general.cancel" = "Anuluj";
"general.username" = "Nazwa użytkownika";
"general.password" = "Hasło";
"general.na" = "N/A";

"input.value_is_empty" = "Wartość nie może być pusta.";
"input.already_exists" = "Wartość już istnieje.";

// Guide Window
"guide.highlights" = "Najważniejsze";
"guide.basic_settings" = "Ustawienia podstawowe";
"guide.faq" = "Najczęściej zadawane pytania (FAQ)";

// Initial Window
"initial.announcement" = "Używasz wersji %@ IINA";
"initial.beta.desc" = "Jeśli chcesz wrócić do wersji stabilnej, odznacz \"otrzymuj aktualizacje wersji beta\" w Ustawienia > Ogólne, i zainstaluj stabilne wydanie z naszej <a href=\"https://iina.io\">oficjalnej strony</a>.";
"initial.nightly.desc" = "Wersja \"Nightly\" nie jest zalecana do codziennego użytku. Aktualnie nie wspiera ona automatycznej aktualizacji. Proszę, pobierz ręcznie nowsze wersje z naszej <a href=\"https://nightly.iina.io\">strony internetowej nightly</a>.";
"initial.debug.desc" = "Wersje \"Debug\" przeważnie nie są zoptymalizowane pod kątem wydajności, więc nie jest zalecane wykorzystywanie ich jako wersji codziennego użytku. Wersje \"Debug\" nie wspierają automatycznych aktualizacji.";
"initial.bug_report" = "Zgłoś przez <a href=\"https://github.com/iina/iina/issues\">GitHub issues</a>.";

// Inspector Window
"inspector.error" = "Błąd";

// MainWindowController.swift
"main.buffering_indicator" = "Buforowanie… %d%%";
"main.opening_stream" = "Otwieram strumień…";
"main.seeking_indicator" = "Poszukiwanie…";
"osc.precision" = "Dokładność";
"osc.1s" = "1 sekunda";
"osc.100ms" = "100 milisekund";
"osc.10ms" = "10 milisekund";
"osc.1ms" = "1 milisekund";

// QuickSettingViewController.swift
"quicksetting.item_default" = "Domyślne";
"quicksetting.item_none" = "Brak";
"quicksetting.hwdec" = "Dekodowanie sprzętowe";
"quicksetting.deinterlace" = "Usuwanie przeplotu";
"quicksetting.hdr" = "HDR";
"quicksetting.hide" = "Ukryj";
"quicksetting.reset_speed" = "Prędkość rzeczywista";

// EQ Presets
"eq.preset.flat" = "Płasko";
"eq.preset.acoustic" = "Akustycznie";
"eq.preset.classical" = "Klasyczny";
"eq.preset.dance" = "Taniec";
"eq.preset.deep" = "Głęboki";
"eq.preset.electronic" = "Elektroniczne";
"eq.preset.hip_hop" = "Hip Hop";
"eq.preset.increase_bass" = "Zwiększ bas";
"eq.preset.increase_treble" = "Zwiększ wysokie tony";
"eq.preset.increase_vocal" = "Zwiększ wokal";
"eq.preset.jazz" = "Jazz";
"eq.preset.latin" = "Łacina";
"eq.preset.loundness" = "Głośność";
"eq.preset.lounge" = "Poczekalnia";
"eq.preset.piano" = "Pianino";
"eq.preset.pop" = "Pop";
"eq.preset.rnb" = "R&B";
"eq.preset.reduce_bass" = "Zmniejsz bass";
"eq.preset.reduce_treble" = "Zmniejsz wysokie tony";
"eq.preset.rock" = "Rock";
"eq.preset.small_speaker" = "Mały głośnik";
"eq.preset.spoken_word" = "Słowo mówione";

"alert.eq.new_profile.title" = "Nowy profil EQ";
"alert.eq.new_profile.message" = "Proszę, wprowadź nazwę profilu.";
"alert.eq.rename.title" = "Zmień nazwę bieżącego profilu";
"alert.eq.rename.message" = "Proszę, wprowadź nową nazwę profilu.";

// OSDMessage.swift
"osd.pause" = "Pauza";
"osd.resume" = "Wznów";
"osd.volume" = "Głośność: %@";
"osd.speed" = "Szybkość: %@x";
"osd.aspect" = "Proporcje obrazu: %@";
"osd.crop" = "Kadrowanie obrazu: %@";
"osd.rotate" = "Obrót: %i°";
"osd.deinterlace" = "Usuwanie przeplotu: %@";
"osd.hwdec" = "Dekodowanie sprzętowe: %@";
"osd.audio_delay.nodelay" = "Opóźnienie dźwięku: Brak";
"osd.audio_delay.later" = "Opóźnienie dźwięku: %@s pózniej";
"osd.audio_delay.earlier" = "Opóźnienie dźwięku: %@s wcześniej";
"osd.sub_delay.nodelay" = "Opóźnienie napisów: Brak";
"osd.sub_delay.later" = "Opóźnienie napisów: %@s później";
"osd.sub_delay.earlier" = "Opóźnienie napisów: %@s wcześniej";
"osd.subtitle_pos" = "Pozycja napisów: %@";
"osd.sub_hidden" = "Napisy ukryte";
"osd.sub_visible" = "Napisy widoczne";
"osd.sub_second_delay.nodelay" = "Opóźnienie napisów dodatkowych: Brak opóźnienia";
"osd.sub_second_delay.later" = "Opóźnienie napisów dodatkowych: %@s później";
"osd.sub_second_delay.earlier" = "Opóźnienie napisów dodatkowych: %@s wcześniej
";
"osd.sub_second_hidden" = "Napisów dodatkowe ukryte";
"osd.sub_second_pos" = "Pozycja dodatkowych napisów: %@";
"osd.sub_second_visible" = ".";
"osd.mute" = "Wycisz dźwięk";
"osd.unmute" = "Włącz dźwięk";
"osd.screenshot" = "Zachowano zrzut ekranu";
"osd.abloop.a" = "Pętla-AB: A";
"osd.abloop.b" = "Pętla-AB: B";
"osd.abloop.clear" = "Pętla-AB: wyczyszczono";
"osd.stop" = "Zatrzymaj";
"osd.chapter" = "Rozdział: %@";
"osd.subtitle_scale" = "Skala napisów: %@x";
"osd.add_to_playlist" = "Dodano %i plików do playlisty";
"osd.clear_playlist" = "Wyczyszczono playlistę";
"osd.video_eq.contrast" = "Kontrast: %i";
"osd.video_eq.gamma" = "Gamma: %i";
"osd.video_eq.hue" = "Odcień: %i";
"osd.video_eq.saturation" = "Nasycenie: %i";
"osd.video_eq.brightness" = "Jasność: %i";
"osd.find_online_sub" = "Wyszukiwanie napisów online…";
"osd.find_online_sub.source" = "z";
"osd.sub_not_found" = "Nie znaleziono pasujących napisów";
"osd.sub_found" = "%d znaleziono napisy.";
"osd.sub_downloading" = "Pobieranie %d napisów";
"osd.sub_downloaded" = "Pobrano napisy";
"osd.sub_saved" = "Zapisano napisy";
"osd.network_error" = "Błąd sieci";
"osd.file_error" = "Błąd wczytywania pliku";
"osd.cannot_login" = "Nie można się zalogować";
"osd.canceled" = "Anulowane";
"osd.cannot_connect" = "Błąd połączenia";
"osd.timed_out" = "Upłynął limit czasu odpowiedzi";
"osd.filter_added" = "Dodano filtr: %@";
"osd.filter_removed" = "Usunięto filtr";
"osd.file_loop" = "Zapętl pojedynczy plik";
"osd.playlist_loop" = "Zapętl playlistę";
"osd.no_loop" = "Wyłącz zapętlenie";

"preference.title" = "Preferencje";
"preference.general" = "Ogólne";
"preference.ui" = "Interfejs";
"preference.video_audio" = "Wideo/Audio";
"preference.subtitle" = "Napisy";
"preference.network" = "Sieć";
"preference.control" = "Kontrola";
"preference.keybindings" = "Skróty klawiszowe";
"preference.advanced" = "Zaawansowane";
"preference.plugins" = "Wtyczki";
"preference.utilities" = "Narzędzia";
"preference.scripts" = "Skrypty";
"preference.not_logged_in" = "Nie zalogowano";
"preference.logged_in_as" = "Zalogowano jako %@";
"preference.system_media_control" = "Sterowanie odtwarzania klawiszami multimedialnymi";

"preference.key_binding_hint_1" = "Aby edytować skróty klawiszowe najpierw kliknij \"Zduplikuj konfiguracje\", aby wykonać kopię.";
"preference.key_binding_hint_2" = "Kliknij dwukrotnie na rząd po prawej stronie, aby zmienić przypisany skrót klawiszowy";

"preference.enable_adv_settings" = "Włącz ustawienia zaawansowane";

"preference.sub_override_level.no" = "nie";
"preference.sub_override_level.force" = "wymuś";
"preference.sub_override_level.scale" = "skala";
"preference.sub_override_level.strip" = "pasek";
"preference.sub_override_level.yes" = "tak";

"preference.sub_override_level.descriptive_text.no" = "Wyświetlaj napisy zgodnie ze specyfikacją skryptów napisów, bez nadpisywania.";
"preference.sub_override_level.descriptive_text.force" = "Zastosuj wszystkie style napisów.";
"preference.sub_override_level.descriptive_text.scale" = "Zastosuj ustawienia skali oprócz ustawień stylu w tej sekcji.";
"preference.sub_override_level.descriptive_text.strip" = "Całkowicie usuń wszystkie tagi i style ASS z napisów.";
"preference.sub_override_level.descriptive_text.yes" = "Zastosuj wszystkie ustawienia stylów w tej sekcji.";

"preference.ytdl_plugin_not_installed" = "Zainstaluj wtyczkę Online Media poprzez „Wtyczki > Zainstaluj z GitHub”, aby korzystać z zaawansowanych funkcji, takich jak pobieranie filmów i automatyczne aktualizacje yt-dlp.";
"preference.ytdl_plugin_installed" = "Wbudowane wsparcie youtube-dl jest wyłączone, ponieważ nie masz zainstalowanej wtyczki Online media.";

"menu.volume" = "Głośność: %@";
"menu.volume_muted" = "Głośność: %@ (Wyciszono)";
"menu.audio_delay" = "Opóźnienie audio: %@s";
"menu.sub_delay" = "Opóźnienie napisów: %@s";
"menu.sub_hide" = "Ukryj napisy";
"menu.sub_show" = "Pokaż napisy";
"menu.sub_second_hide" = "Schowaj dodatkowe napisy";
"menu.sub_second_show" = "Pokaż dodatkowe napisy";
"menu.fullscreen" = "Włącz tryb pełnoekranowy";
"menu.exit_fullscreen" = "Opuść tryb pełnoekranowy";
"menu.pip" = "Włącz tryb Obraz-w-obrazie";
"menu.exit_pip" = "Wyłącz tryb Obraz-w-obrazie";
"menu.mini_player" = "Przejdź do trybu muzycznego";
"menu.exit_mini_player" = "Wyjdź z trybu muzycznego";
"menu.pause" = "Pauza";
"menu.resume" = "Wznów";
"menu.speed" = "Szybkość: %@x";
"menu.chapters" = "Panel rozdziałów";
"menu.hide_chapters" = "Ukryj panel rozdziałów";
"menu.playlist" = "Panel playlisty";
"menu.hide_playlist" = "Ukryj panel listy odtwarzania";
"menu.video" = "Pokaż panel wideo";
"menu.hide_video" = "Ukryj panel wideo";
"menu.audio" = "Pokaż panel audio";
"menu.hide_audio" = "Ukryj panel audio";
"menu.subtitles" = "Pokaż panel napisów";
"menu.hide_subtitles" = "Ukryj panel napisów";

"menu.seek_forward" = "Przewiń w przód o %@s";
"menu.seek_backward" = "Przewiń w tył o %@s";
"menu.speed_up" = "Przyspiesz o %@x";
"menu.speed_down" = "Zwolnij o %@x";
"menu.volume_up" = "Głośność +%@%%";
"menu.volume_down" = "Głośność -%@%%";
"menu.audio_delay_up" = "Opóźnienie audio +%@s";
"menu.audio_delay_down" = "Opóźnienie audio -%@s";
"menu.sub_delay_up" = "Opóźnienie napisów +%@s";
"menu.sub_delay_down" = "Opóźnienie napisów -%@s";

"menu.crop_custom" = "Własne…";
"menu.find_online_sub" = "Znajdź napisy online z %@";

"menu.manage_plugins" = "Zarządzaj wtyczkami…";
"menu.developer_tool" = "Narzędzia deweloperskie";
"menu.more_plugin" = "Więcej…";
"menu.conflicting_shortcuts" = "Konflikt skrótów klawiszowych…";
"menu.reload_plugins" = "Przeładuj wszystkie wtyczki";
"menu.show_plugins_panel" = "Pokaż panel wtyczek";
"menu.hide_plugins_panel" = "Ukryj panel wtyczek";

"track.audio" = "Dźwięk";
"track.none" = "<Brak>";
"track.sub" = "Napisy";
"track.video" = "Obraz";

"subtrack.no_loaded" = "Brak wczytanych napisów";
"subtrack.no_external" = "Nie znaleziono zewnętrznych napisów";

// Alerts
"alert.beta_channel.title" = "Otrzymuj aktualizację wersj Beta";

"alert.title_error" = "Błąd";
"alert.title_warning" = "Ostrzeżenie";
"alert.title_info" = "Informacja";

"alert.fatal_error" = "Błąd krytyczny: %@ \nAplikacja zostanie zamknięta.";
"alert.mpv_error" = "Wystąpił wewnętrzny błąd %@ (%@) podczas ustawiania opcji %@.";

"alert.unsupported_audio" = "Nieobsługiwany zewnętrzny plik audio.";
"alert.unsupported_video" = "Nieobsługiwany zewnętrzny plik wideo.";
"alert.unsupported_sub" = "Nieobsługiwane zewnętrzne napisy.";
"alert.unsupported_url" = "Nieobsługiwany adres URL.";
"alert.wrong_url_format" = "Nieprawidłowy format adresu URL.";

"alert.error_open" = "Nie można otworzyć pliku lub strumienia!";
"alert.error_finding_file" = "Nie odnaleziono %@!";
"alert.error_loading_script" = "Nie można załadować skryptu %@!";
"alert.error_saving_file" = "Podczas zapisywania %@ wystąpił błąd: %@";
"alert.error_deleting_file" = "Nie można usunąć pliku.";

"alert.target_peak.bad_value" = "Wartość \"%@\" jest nieprawidłowa.\nProszę podaj wartość między 10 a 10000, lub 0.";

"alert.config.new.title" = "Nowa konfiguracja wejściowa";
"alert.config.new.message" = "Wprowadź nazwę nowej konfiguracji.";
"alert.config.duplicate.title" = "Powiel konfigurację";
"alert.config.duplicate.message" = "Proszę wprowadzić nazwę dla duplikatu pliku konfiguracyjnego.";
"alert.config.file_existing.title" = "Plik już istnieje";
"alert.config.file_existing.message" = "Plik konfiguracyjny o tej samej nazwie już istnieje.";
"alert.config.cannot_create" = "Nie można utworzyć pliku konfiguracyjnego!\n%@";
"alert.config.cannot_write" = "Nie można zapisać pliku konfiguracyjnego!";
"alert.config.rename.title" = "Zmień nazwę konfiguracji wejść";
"alert.config.rename.message" = "Proszę, wprowadź nową nazwę dla konfiguracji.";

"alert.filter.incorrect" = "Podczas ustawiania filtrów wystąpił błąd. Proszę sprawdzić format parametru.";
"alert.add_filter.title" = "Nowy filtr";
"alert.add_filter.message" = "Wprowadź filtry w formacie zgodnym ze specyfikacją mpv.";

"alert.keybinding_config.error" = "Wystąpił błąd podczas wczytywania skrótów klawiszowych \"%@\". Sprawdź, czy plik z konfiguracją jest poprawny.";

"alert.extra_option.cannot_read" = "Nie można wczytać konfiguracji mpv.";
"alert.extra_option.empty" = "Klucz lub wartość nie może być pusta!";
"alert.extra_option.error" = "Błędu ustawienia opcji --%@=%@ z wartością zwrotu %d. Sprawdź ustawienia dodatkowych opcji w Preferencje > Zaawansowane.";
"alert.extra_option.config_folder" = "Błąd podczas ustawiania ścieżki z konfiguracją \"%@\".";

"alert.playlist.error_deleting" = "Błąd podczas usuwania: %@";

"alert.screenshot.error_taking" = "Nie można zrobić zrzutu ekranu!";

"alert.sub.no_selected" = "Proszę najpierw wybrać pobrane napisy.";
"alert.sub_lang_not_set" = "Przed użyciem OpenSubtitles ustaw preferowany język napisów w preferencjach. Angielski(eng) zostaną tym razem użyte.";
"alert.sub.cannot_save_passwd" = "Nie można zapisać hasła do pęku kluczy: %@";
"alert.sub.cannot_login" = "Logowanie nie powiodło się. Sprawdź swoją nazwę użytkownika, hasło oraz stan sieci.\n\n%@";
"alert.sub.save_downloaded.title" = "Zapisz pobrane napisy";

"alert.set_default.title" = "Ustaw IINA jako domyślą aplikację";
"alert.set_default.message" = "IINA zostanie ustawiona jako domyślna aplikacja dla wszystkich obsługiwanych typów plików.";
"alert.set_default.success" = "Zakończono z %d sukcesem oraz %d porażką.";

"alert.add_watch.title" = "Dodaj obiekt do obejrzenia";
"alert.add_watch.message" = "Wprowadź poprawną nazwę parametru MPV.";

"alert.jump_to.title" = "Przeskocz do";
"alert.jump_to.message" = "Wprowadź czas, do którego chcesz przeskoczyć. Przykład: 20:35";

"alert.opensub.login.title" = "Logowanie do OpenSubtitles";
"alert.opensub.login.message" = "Wprowadź swoją nazwę użytkownika oraz hasło";

"alert.open_url.title" = "Otwórz adres URL";
"alert.open_url.message" = "Wprowadź adres URL:";
"alert.choose_media_file.title" = "Wybierz pliki multimedialne";

"alert.add_url.title" = "Dodaj adres URL";
"alert.add_url.message" = "Wprowadź adres URL:";

"alert.delete_history.title" = "Usuń historię odtwarzania";
"alert.delete_history.message" = "Czy na pewno chcesz usunąć zaznaczone pozycje?";

"alert.filter_hwdec.message" = "Zamierzasz zastosować filtr wideo.  Niestety twój dekoder sprzętowy może nie wpierać filtrów wideo.  Możesz wyłączyć dekodowanie sprzętowe lub przełączyć w tryb Auto(Copy) co spowoduje podwójne zużycie pamięci.  Może być wymagane powtórzenie poprzedniej operacji (jak ustawienie wycięcia) aby ustawienie zadziałało.";
"alert.filter_hwdec.abort" = "Przerwij";
"alert.filter_hwdec.turn_off" = "Wyłącz dekodowanie sprzętowe";
"alert.filter_hwdec.use_copy" = "Przełącz na automatyczne (Kopiowanie)";

"alert.clear_cache.title" = "Wyczyść pamięć podręczną miniatur";
"alert.clear_cache.message" = "Jesteś pewien, że chcesz wyczyścić pamięć podręczną miniatur?";

"alert.clear_history.title" = "Wyczyść historię odtwarzania";
"alert.clear_history.message" = "Czy na pewno chcesz usunąć całą historię odtwarzania?";

"alert.clear_watch_later.title" = "Wyczyść zapisane postępy odtwarzania";
"alert.clear_watch_later.message" = "Czy na pewno chcesz usunąć wszystkie postępy odtwarzania (dane \"obejrzyj później\") ?";

"alert.restore_alerts.title" = "Przywróć ukryte alerty";
"alert.restore_alerts.message" = "Czy na pewno chcesz przywrócić ukryte alerty?";

"alert.nothing_to_open" = "Nic do otwarcia.";

"alert.no_video_track" = "Ten plik nie posiada żadnej ścieżki video.";

"alert.duplicate_config" = "Nie możesz edytować domyślnej konfiguracji. Musisz ją najpierw powielić przed edycją.";

"alert.assrt_register" = "Z powodu limitu zapytań do API, zalecamy korzystanie z własnego tokenu API. Domyślny token jest przeznaczony wyłącznie do celów demonstracyjnych.";
"alert.assrt_register.register" = "Zarejestruj się teraz";
"alert.assrt_register.try" = "Sprawdź teraz";
"alert.assrt_token_prompt.title" = "Wprowadź token API";
"alert.assrt_token_prompt.message" = "Zarejestruj się na otwartej stronie. Następnie wygeneruj własny token na stronie domowej swojego profilu i wprowadź go poniżej:";
"alert.assrt_token_invalid" = "Twój token Assrt API wygląda na nieprawidłowy.";

"alert.plugin_uninstall.title" = "Czy na pewno chcesz odinstalować %@?";
"alert.plugin_uninstall.message" = "Wtyczka zostanie usunięta z Twojego dysku.";
"alert.plugin_reinstall.title" = "Wtyczka %@ już istnieje";
"alert.plugin_reinstall.message" = "Czy chcesz ponownie zainstalować wtyczkę?";
"alert.duplicated_plugin_id" = "Wykryto zduplikowane identyfikatory wtyczek. Dwie lub więcej wtyczek ma ten sam identyfikator \"%@\". Może to powodować nietypowe zachowania. Znajdź je w Preferencjach - Wtyczki i zgłoś ich autorom. Jeśli wtyczka jest zainstalowana lokalnie, możesz też ręcznie zmienić jej identyfikator w pliku Info.json wtyczki.";
"alert.plugin_no_update" = "Nie znaleziono aktualizacji.";
"alert.plugin_update_found.title" = "Znaleziono aktualizację dla %@";
"alert.plugin_update_found.message" = "Najnowsza wersja to %@. Masz %@. Czy chcesz zaktualizować?";
"alert.plugin_permission" = "Ta wtyczka wymaga następujących uprawnień. Sprawdź je przed kontynuowaniem.";
"alert.plugin_permission_added" = "Ta aktualizacja wymaga dodatkowych uprawnień. Sprawdź je przed kontynuowaniem.";

"playlist.total_length" = "Całkowity czas %@";
"playlist.total_length_with_selected" = "Zaznaczono %@ z %@";
"playlist.sorting.header" = "Sortowanie";
"playlist.sorting.filename_ascending" = "Nazwa pliku rosnąco";
"playlist.sorting.filename_descending" = "Nazwa pliku malejąco";
"playlist.sorting.path_ascending" = "Ścieżka pliku rosnąco";
"playlist.sorting.path_descending" = "Ścieżka pliku malejąco";
"pl_menu.title_multi" = "%d plików";
"pl_menu.play_next" = "Odtwórz następny";
"pl_menu.play_in_new_window" = "Odtwórz w nowym oknie";
"pl_menu.remove" = "Usuń";
"pl_menu.remove_multi" = "Usuń zaznaczone";
"pl_menu.delete" = "Przenieś do kosza";
"pl_menu.delete_multi" = "Przenieś wybrane pliki do kosza";
"pl_menu.delete_after_play" = "Przenieś plik do kosza po zakończeniu odtwarzania";
"pl_menu.delete_after_play_multi" = "Przenieś po odtwarzaniu wybrane pliki do kosza";
"pl_menu.show_in_finder" = "Pokaż w Finderze";
"pl_menu.add_file" = "Dodaj plik…";
"pl_menu.add_url" = "Dodaj adres URL…";
"pl_menu.clear_playlist" = "Wyczyść playlistę";
"pl_menu.matched_sub" = "Pasujących napisów: %d";
"pl_menu.add_sub" = "Dodaj napisy…";
"pl_menu.wrong_sub" = "Nie można odczytać formatu napisów";
"pl_menu.browser" = "Owtórz w przeglądarce";
"pl_menu.copy_url" = "Kopiuj adres URL";
"pl_menu.copy_url_multi" = "Kopiuj adresy URL";

"keymapping.title" = "Mapowanie klawiszy";
"keymapping.message" = "Naciśnij dowolny klawisz, aby zarejestrować.";

"filter.video_filters" = "Filtry video";
"filter.audio_filters" = "Filtry audio";

"hwdec.no" = "Wyłącz dekodowanie sprzętowe.";
"hwdec.auto" = "Włącz dekodowanie sprzętowe. Większość filtrów obrazu nie zadziała prawidłowo.";
"hwdec.auto-copy" = "Włącz dekodowanie sprzętowe. Zużyje to podwójną ilość pamięci, ale zadziała z filtrami wideo.";

"gaplessAudio.no" = "Odtwarzanie kolejnych plików dźwiękowych może spowodować wyciszenie lub zakłócenie w punkcie zmiany pliku.";
"gaplessAudio.weak" = "Jeśli zmieni się format audio wyjścia dekodującego, dźwięk zostanie przerwany, zamknięty i ponownie otwarty,  zakłócając odtwarzanie.";
"gaplessAudio.yes" = "Urządzenie audio jest otwierane przy użyciu parametrów wybranych dla pierwszego pliku odtwarzanego i pozostaje otwarte dla odtwarzania bez przerw odtwarzania. Następujące pliki mogą być ponownie samplowane.";

"subencoding.auto" = "Auto detekcja";

"osc_toolbar.settings" = "Szybkie ustawienia";
"osc_toolbar.playlist" = "Playlista i rozdziały";
"osc_toolbar.pip" = "Przełącz tryb Obraz-w-obrazie";
"osc_toolbar.full_screen" = "Przełącz tryb pełnoekranowy";
"osc_toolbar.music_mode" = "Przejdź w tryb muzyczny";
"osc_toolbar.sub_track" = "Wybierz ścieżkę napisów";
"osc_toolbar.screenshot" = "Wykonaj zrzut ekranu";
"osc_toolbar.plugins" = "Pokaż panel ze wtyczkami";

"mini_player.album_art" = "Przełącz okładkę albumu";
"mini_player.loop" = "Powtarzaj";
"mini_player.shuffle" = "Wymieszaj listę odtwarzania";
"mini_player.remove" = "Usuń z listy odtwarzania";
"mini_player.add" = "Dodaj do listy odtwarzania";
"mini_player.delete" = "Usuń wszystkie pozycje z listy odtwarzania";
"mini_player.volume" = "Głośność";
"mini_player.close" = "Zamknij tryb muzyczny";
"mini_player.back" = "Wróć do trybu wideo";
"mini_player.sort" = "Sortuj playlistę";

// Touch bar

"touchbar.ahead_15" = "15 sek. do przodu";
"touchbar.ahead_30" = "30 sek. do przodu";
"touchbar.back_15" = "15 sek. do tyłu";
"touchbar.back_30" = "30 sek. do tyłu";
"touchbar.next_video" = "Następne wideo";
"touchbar.prev_video" = "Poprzednie wideo";
"touchbar.increase_volume" = "Głośność +";
"touchbar.decrease_volume" = "Głośność -";
"touchbar.rewind" = "Przewijanie do tyłu";
"touchbar.fast_forward" = "Szybkie przewijanie do przodu";
"touchbar.play_pause" = "Odtwarzanie / Pauza";
"touchbar.seek" = "Szukaj";
"touchbar.time" = "Pozycja czasowa";
"touchbar.remainingTimeOrTotalDuration" = "Pozostały czas / Całkowity czas trwania";
"touchbar.toggle_pip" = "Przełącz tryb Obraz-w-obrazie";

// Plugin permissions

"permissions.network-request.name" = "Żądanie sieciowe";
"permissions.network-request.desc" = "Ta wtyczka może żądać danych lub przesłać dane na te strony:";
"permissions.network-request.any_site" = "Dowolna strona";
"permissions.show-osd.name" = "Pokaż OSD";
"permissions.show-osd.desc" = "Ta wtyczka może pokazywać wiadomości OSD (na ekranie wyświetlacza).";
"permissions.show-alert.name" = "Pokaż alerty";
"permissions.show-alert.desc" = "Ta wtyczka może wyświetlać wyskakujące powiadomienia.";
"permissions.video-overlay.name" = "Dodaj nakładkę na filmy";
"permissions.video-overlay.desc" = "Ta wtyczka może renderować dodatkowe treści nałożone na film.";
"permissions.file-system.name" = "Dostęp do systemu plików";
"permissions.file-system.desc" = "Ta wtyczka może odczytywać i zapisywać pliki na dysku, w tym poufne informacje. Może także wywoływać inne programy lub aplikacje, które mogą uszkodzić komputer. Dlatego koniecznie sprawdź źródło.";

"plugin.install" = "Zainstaluj";
"plugin.installed" = "Zainstalowano";
"plugin.not_installed" = "Nie zainstalowano";
"plugin.local" = "Zainstalowane lokalnie";
"alert.plugin.install_error" = "Wystąpił błąd podczas instalacji: %@";
"alert.invalid_url" = "Adres URL jest nieprawidłowy.";
"plugin.install_error.invalid_url" = "Adres URL jest nieprawidłowy.";
"plugin.install_error.file_not_found" = "Nie można znaleźć pliku pakietu.";
"plugin.install_error.cannot_download" = "Nie udało się pobrać wtyczki.\n\nWyjście:%@\n";
"plugin.install_error.cannot_unpackage" = "Nie udało się rozpakować wtyczki.\n\nWyjście:%@\n";
"plugin.install_error.cannot_load" = "IINA nie może załadować tej wtyczki. Może być w złym formacie.";
"plugin.check_for_updates" = "Sprawdź aktualizacje";
"plugin.updating" = "Pobieranie aktualizacji…";
